---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotDimStyleSlopeUnitsAlt
source: html/0f1157c4-e428-49b5-adb5-8b3d07b69bbd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotDimStyleSlopeUnitsAlt Property

"Alternate Units Format"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotDimStyleSlopeUnitsAlt { get; }
```